Revit 2027 API
FailureDefinitionRegistry.ListAllFailureDefinitions Method
 Retrieves all the registered FailureDefinitions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureDefinitionAccessor> ListAllFailureDefinitions()
Public Function ListAllFailureDefinitions As IList(Of FailureDefinitionAccessor)
public:
IList<FailureDefinitionAccessor^>^ ListAllFailureDefinitions()
member ListAllFailureDefinitions : unit -> IList<FailureDefinitionAccessor>
Return Value
IList<FailureDefinitionAccessor>
 All the registered FailureDefinitions.
See Also
Reference
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace